NMMI/SoftHandPRO-and-Generic-FW-PSoC5/Ottobock_Active_Wrist.cydsn/codegentemp/ADC_N_CHANNELS_USED.h
/*******************************************************************************
* File Name: ADC_N_CHANNELS_USED.h  
* Version 1.80
*
* Description:
*  This file containts Control Register function prototypes and register defines
*
* Note:
*
********************************************************************************
* Copyright 2008-2015, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
*******************************************************************************/

#if !defined(CY_CONTROL_REG_ADC_N_CHANNELS_USED_H) /* CY_CONTROL_REG_ADC_N_CHANNELS_USED_H */
#define CY_CONTROL_REG_ADC_N_CHANNELS_USED_H

#include "cyfitter.h"

#if ((CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC3) || \
     (CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC4) || \
     (CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC5))
    #include "cytypes.h"
#else
    #include "syslib/cy_syslib.h"
#endif

    
/***************************************
*     Data Struct Definitions
***************************************/

/* Sleep Mode API Support */
typedef struct
{
    uint8 controlState;

} ADC_N_CHANNELS_USED_BACKUP_STRUCT;


/***************************************
*         Function Prototypes 
***************************************/

void    ADC_N_CHANNELS_USED_Write(uint8 control) ;
uint8   ADC_N_CHANNELS_USED_Read(void) ;

void ADC_N_CHANNELS_USED_SaveConfig(void) ;
void ADC_N_CHANNELS_USED_RestoreConfig(void) ;
void ADC_N_CHANNELS_USED_Sleep(void) ; 
void ADC_N_CHANNELS_USED_Wakeup(void) ;


/***************************************
*            Registers        
***************************************/

/* Control Register */
#define ADC_N_CHANNELS_USED_Control        (* (reg8 *) ADC_N_CHANNELS_USED_Sync_ctrl_reg__CONTROL_REG )
#define ADC_N_CHANNELS_USED_Control_PTR    (  (reg8 *) ADC_N_CHANNELS_USED_Sync_ctrl_reg__CONTROL_REG )

#endif /* End CY_CONTROL_REG_ADC_N_CHANNELS_USED_H */


/* [] END OF FILE */
